#代码 4-14
# 使用for语句循环输出2,5,10的平方根
n <- c(2, 5, 10)
for (i in n) {
  x <- sqrt(i)  # 计算平方根
  cat("sqrt(" , i , ") =", x, "\n")  # 输出每次循环的结果
}


#代码 4-15
# 使用while语句生成10个斐波那契数列
x <- c(1, 1)
i <- 3
while (i <= 10) {  # 当i>10时循环停止
  x[i] <- x[i - 1] + x[i - 2]  # 计算前两项的和
  i <- i + 1
}
x

#代码 4-16
# 根据用户的单击数将用户分为“初级用户”，“中级用户”和“高级用户”
pv <- c(1, 1, 2, 3, 1, 1, 15, 7, 18)
i <- 1
result <- ""
repeat {
  if (i > length(pv)) {  # 设置循环结束时的跳出语句
    break
  }
  if (pv[i] <= 5) {
    result[i] <- "初级用户";  # 单击数小于等于5的用户为“初级用户”
  } else if (pv[i] <= 15) {
    result[i] <- "中级用户";  # 单击数大于5小于等于15的用户为“中级用户”
  } else {
    result[i] <- "高级用户";  # 单击数大于15的用户为“高级用户”
  }
  i <- i + 1
}
result
